// Напишите программу вычисления модуля числа
Console.WriteLine("Введите число  ");
int Modul = Convert.ToInt32(Console.ReadLine());
 if (a>=0)
 {
     Console.WriteLine("Модуль числа a равен " + a );
 }
 else
 {
     Console.WriteLine("Модуль числа a равен " + -a);
 }